#------------------------------------------------------------------------------------------
#                                ИТЕРАТОРЫ
#                                Что такое итерируемый объект (iterable)?
#------------------------------------------------------------------------------------------ 
# Это объект, который предоставляет возможность поочерёдного обхода по своим элементам
#------------------------------------------------------------------------------------------ 
#               Что такое итератор? Как создать итератор из коллекции?

a = [1, 2, 3]
i = iter(a)
print(next(i))
#------------------------------------------------------------------------------------------ 
#               Как сделать класс, который будет поддерживать протокол итератора?
#------------------------------------------------------------------------------------------ 

class Counter:
    current: int

    def __init__(self) -> None:
        self.current = 0

    def __iter__(self):
        return self

    def __next__(self):
        current = self.current
        self.current += 1
        return current  
    
c = Counter()
for i in c:
    print(i)
    if i == 100:
        break
    
print(next(i))       